Project/Toir/src/Documents/торо_ОстановочныеРемонты/торо_ОстановочныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ОстановочныеРемонты</name>
  <basedOn>Document.торо_ПланГрафикРемонта</basedOn>
  <basedOn>Document.торо_ЗаявкаНаРемонт</basedOn>
  <basedOn>Document.торо_ОстановочныеРемонты</basedOn>
  <registerRecords>InformationRegister.торо_ОстановочныеРемонты</registerRecords>
  <registerRecords>InformationRegister.торо_ЗаявкиПоРемонтам</registerRecords>
  <registerRecords>InformationRegister.торо_СоответствиеКорректировокДокументамППР</registerRecords>
  <registerRecords>InformationRegister.торо_ПлановыеРемонтныеРаботы</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>IDОсновногоРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийДокументаОстановочныйРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректируемыйДокумент</name>
    <type>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРемонтаСт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРемонтаСт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Сводный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеРемонты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонтаСтарая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонтаСтарая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Отвязать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <type>
        <types>CatalogRef.торо_КритичностьДефекта</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ОписаниеРемонта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Статус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_СоответствиеКорректировокДокументамППР/торо_СоответствиеКорректировокДокументамППР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СоответствиеКорректировокДокументамППР</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Корректировка</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корректируемый</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ЗавершенныеРемонтныеРаботы/торо_ЗавершенныеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗавершенныеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_РемонтыОсновногоЗависимогоОборудования/торо_РемонтыОсновногоЗависимогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РемонтыОсновногоЗависимогоОборудования</name>
  <resources>
    <name>гкс_Остановочная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>гкс_Технологическая</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновнойОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязанныйОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтаОсновногоОбъекта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтаЗависимогоОбъекта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Documents/торо_ОстановочныеРемонты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Функция предназначена для обновления доступности документа для редактирования.
//
// Параметры:
//		Ссылка - Ссылка - ссылка на документ, 
//		СвязанныеРемонты	- ТаблицаЗначений - план ремонтов документа.
//
// Возвращаемое значение: 
//		Массив - массив доступных для корректировки строк.
Функция ОбновитьДоступностьДляРедактирования(Ссылка, СвязанныеРемонты) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаID.ID КАК ID
	               |ПОМЕСТИТЬ ТаблицаID
	               |ИЗ
	               |	&ТаблицаID КАК ТаблицаID
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_СоответствиеКорректировокДокументамППР.Корректировка КАК Корректировка
	               |ПОМЕСТИТЬ торо_СоответствиеКорректировокДокументамППР
	               |ИЗ
	               |	РегистрСведений.торо_СоответствиеКорректировокДокументамППР КАК торо_СоответствиеКорректировокДокументамППР
	               |ГДЕ
	               |	торо_СоответствиеКорректировокДокументамППР.Корректируемый = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ПланГрафикРемонтаПланРемонтов.ID КАК ID
	               |ПОМЕСТИТЬ РемонтыКорректировок
	               |ИЗ
	               |	Документ.торо_ОстановочныеРемонты.СвязанныеРемонты КАК торо_ПланГрафикРемонтаПланРемонтов
	               |ГДЕ
	               |	торо_ПланГрафикРемонтаПланРемонтов.Ссылка В
	               |			(ВЫБРАТЬ
	               |				торо_СоответствиеКорректировокДокументамППР.Корректировка
	               |			ИЗ
	               |				торо_СоответствиеКорректировокДокументамППР КАК торо_СоответствиеКорректировокДокументамППР)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаID.ID КАК ID
	               |ПОМЕСТИТЬ РемонтыСКорректировкой
	               |ИЗ
	               |	ТаблицаID КАК ТаблицаID
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РемонтыКорректировок КАК РемонтыКорректировок
	               |		ПО ТаблицаID.ID = РемонтыКорректировок.ID
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID КАК ID
	               |ПОМЕСТИТЬ ЗавершенныеРемонты
	               |ИЗ
	               |	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(
	               |			,
	               |			ID В
	               |				(ВЫБРАТЬ
	               |					ТаблицаID.ID КАК ID
	               |				ИЗ
	               |					ТаблицаID КАК ТаблицаID)) КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаID.ID КАК ID,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА РемонтыСКорректировкой.ID ЕСТЬ NULL
	               |					И ЗавершенныеРемонты.ID ЕСТЬ NULL
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ) КАК ДоступенДляРедактирования
	               |ИЗ
	               |	ТаблицаID КАК ТаблицаID
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РемонтыСКорректировкой КАК РемонтыСКорректировкой
	               |		ПО (РемонтыСКорректировкой.ID = ТаблицаID.ID)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗавершенныеРемонты КАК ЗавершенныеРемонты
	               |		ПО (ЗавершенныеРемонты.ID = ТаблицаID.ID)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаID.ID";
	
	Запрос.УстановитьПараметр("ТаблицаID", СвязанныеРемонты.Скопировать(,"ID"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Ссылка.Дата), Ссылка.Дата, ТекущаяДата()));	
	МассивДоступныхДляКорректировкиСтрок = Запрос.Выполнить().Выгрузить();
	
	Возврат МассивДоступныхДляКорректировкиСтрок;
	
КонецФункции

// Заполняет список команд печати.
//
// Параметры:
//		КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Остановочный ремонт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ОстановочныеРемонты";
	КомандаПечати.Идентификатор = "ОстановочныйРемонт";
	КомандаПечати.Представление = НСтр("es='La reparación de parada';ru='Остановочный ремонт';en='Stop repair'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

// Формирует печатные формы
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОстановочныйРемонт") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
															"ОстановочныйРемонт", 
															"Остановочный ремонт", 
															ПечатьОстановочные(МассивОбъектов, ПараметрыПечати),,
															"Документ.торо_ОстановочныеРемонты.ПФ_MXL_ОстановочныйРемонт");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьОстановочные(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ОстановочныеРемонты.ПФ_MXL_ОстановочныйРемонт"); 
	
	СоответствиеВидовРемонтаПредставлениям    = Новый Соответствие;
	СоответствиеОбъектовРемонтаПредставлениям = Новый Соответствие;
	
	Для каждого ОстановочныйРемонт Из МассивОбъектов Цикл
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		
		ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры, ОстановочныйРемонт, "ОбъектРемонта, ВидРемонта, Номер");
		
		ОбластьЗаголовок.Параметры["ДатаНачалаРемонта"]    = Формат(ОстановочныйРемонт.ДатаНачалаРемонта   , "ДФ=dd.MM.yyyy");
		ОбластьЗаголовок.Параметры["ДатаОкончанияРемонта"] = Формат(ОстановочныйРемонт.ДатаОкончанияРемонта, "ДФ=dd.MM.yyyy");
		
		ТабДок.Вывести(ОбластьЗаголовок);

        ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
		ТабДок.Вывести(ОбластьШапка);
		
		ОбластьМесяцы = Макет.ПолучитьОбласть("Интервал");
		
		ДатаНачала = ОстановочныйРемонт.ДатаНачалаРемонта;
		НомерКолонкиПоПорядку = 1;
		
		ТаблицаДатПоМесяцам = Новый ТаблицаЗначений;
		ТаблицаДатПоМесяцам.Колонки.Добавить("Месяц"                , Новый ОписаниеТипов("Дата"));
		ТаблицаДатПоМесяцам.Колонки.Добавить("НомерКолонкиПоПорядку", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(2,0, ДопустимыйЗнак.Неотрицательный)));
		
		Пока Не ДатаНачала > ОстановочныйРемонт.ДатаОкончанияРемонта Цикл
			
			НС = ТаблицаДатПоМесяцам.Добавить();
			НС.НомерКолонкиПоПорядку = НомерКолонкиПоПорядку;
			НС.Месяц                 = НачалоМесяца(ДатаНачала);
			
			НомерКолонкиПоПорядку = НомерКолонкиПоПорядку + 1;
			
			ОбластьМесяцы.Параметры["НомИнтервала"] = Формат(ДатаНачала, "ДФ='MMMM yyyy'");
			ТабДок.Присоединить(ОбластьМесяцы);
			ДатаНачала = ДобавитьМесяц(ДатаНачала, 1);
			
		КонецЦикла; 
		
		ОбщееЧислоКолонок = НомерКолонкиПоПорядку;
		
		РемонтыОсновного = Новый ТабличныйДокумент;
		РемонтыЗависимого = Новый ТабличныйДокумент;
		
		
		Запрос = Новый Запрос;
		
		Запрос = Новый Запрос;
		
		# Область ТекстЗапроса
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаДатПоМесяцам.Месяц КАК Месяц,
		               |	ТаблицаДатПоМесяцам.НомерКолонкиПоПорядку КАК НомерКолонкиПоПорядку
		               |ПОМЕСТИТЬ Месяцы
		               |ИЗ
		               |	&ТаблицаДатПоМесяцам КАК ТаблицаДатПоМесяцам
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ОбъектРемонта КАК ОбъектРемонта,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ОбъектРемонта.ТехНомер КАК ОбъектРемонтаТехНомер,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ОбъектРемонта.ЗаводскойНомер КАК ОбъектРемонтаЗаводскойНомер,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ОбъектРемонта.ИнвентарныйНомер КАК ОбъектРемонтаИнвентарныйНомер,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ВидРемонта КАК ВидРемонта,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта
		               |ПОМЕСТИТЬ СвязанныеРемонты
		               |ИЗ
		               |	Документ.торо_ОстановочныеРемонты.СвязанныеРемонты КАК торо_ОстановочныеРемонтыСвязанныеРемонты
		               |ГДЕ
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.Ссылка = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта,
		               |	ВидРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта КАК СвязанныйОбъектРемонта,
		               |	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаЗависимогоОбъекта КАК ВидРемонтаЗависимогоОбъекта
		               |ПОМЕСТИТЬ ЗависимоеОборудование
		               |ИЗ
		               |	РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
		               |ГДЕ
		               |	торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта = &ОсновнойОбъектРемонта
		               |	И торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта В
		               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |				СвязанныеРемонты.ОбъектРемонта КАК ОбъектРемонта
		               |			ИЗ
		               |				СвязанныеРемонты КАК СвязанныеРемонты
		               |			ГДЕ
		               |				НЕ СвязанныеРемонты.ОбъектРемонта = &ОсновнойОбъектРемонта)
		               |	И (торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаОсновногоОбъекта = &ВидРемонта
		               |			ИЛИ торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаОсновногоОбъекта = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка))
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	СвязанныйОбъектРемонта,
		               |	ВидРемонтаЗависимогоОбъекта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СвязанныеРемонты.ОбъектРемонта КАК ОбъектРемонта,
		               |	СвязанныеРемонты.ОбъектРемонта.ТехНомер КАК ОбъектРемонтаТехНомер,
		               |	СвязанныеРемонты.ОбъектРемонта.ЗаводскойНомер КАК ОбъектРемонтаЗаводскойНомер,
		               |	СвязанныеРемонты.ОбъектРемонта.ИнвентарныйНомер КАК ОбъектРемонтаИнвентарныйНомер,
		               |	СвязанныеРемонты.ВидРемонта КАК ВидРемонта,
		               |	СвязанныеРемонты.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
		               |	СвязанныеРемонты.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
		               |	ВЫБОР
		               |		КОГДА ЗависимоеОборудование.СвязанныйОбъектРемонта ЕСТЬ NULL
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК Зависимый,
		               |	ВЫБОР
		               |		КОГДА ЗависимоеОборудование.СвязанныйОбъектРемонта ЕСТЬ NULL
		               |				И НЕ СвязанныеРемонты.ОбъектРемонта = &ОсновнойОбъектРемонта
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК Подчиненный
		               |ПОМЕСТИТЬ СвязанныеРемонтыСФлагами
		               |ИЗ
		               |	СвязанныеРемонты КАК СвязанныеРемонты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗависимоеОборудование КАК ЗависимоеОборудование
		               |		ПО СвязанныеРемонты.ОбъектРемонта = ЗависимоеОборудование.СвязанныйОбъектРемонта
		               |			И НЕ (НЕ СвязанныеРемонты.ВидРемонта = ЗависимоеОборудование.ВидРемонтаЗависимогоОбъекта
					   |                    И НЕ ЗависимоеОборудование.ВидРемонтаЗависимогоОбъекта = Значение(Справочник.торо_ВидыРемонтов.ПустаяСсылка))
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СвязанныеРемонты.ОбъектРемонта КАК НаименовОбъекта,
		               |	СвязанныеРемонты.ОбъектРемонтаТехНомер КАК ТехнологическийН,
		               |	СвязанныеРемонты.ОбъектРемонтаЗаводскойНомер КАК ЗаводскойН,
		               |	СвязанныеРемонты.ОбъектРемонтаИнвентарныйНомер КАК ИнвентарныйН,
		               |	СвязанныеРемонты.ВидРемонта КАК ВидРемонта,
		               |	СвязанныеРемонты.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
		               |	СвязанныеРемонты.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
		               |	Месяцы.Месяц КАК Месяц,
		               |	Месяцы.НомерКолонкиПоПорядку КАК НомерКолонкиПоПорядку,
		               |	ВЫБОР
		               |		КОГДА НЕ СвязанныеРемонты.Зависимый
		               |				И НЕ СвязанныеРемонты.Подчиненный
		               |			ТОГДА 1
		               |		КОГДА НЕ СвязанныеРемонты.Зависимый
		               |			ТОГДА 3
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК ВидПодчиненностиРемонта
		               |ИЗ
		               |	СвязанныеРемонтыСФлагами КАК СвязанныеРемонты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Месяцы КАК Месяцы
		               |		ПО (СвязанныеРемонты.ДатаНачалаРемонта МЕЖДУ НАЧАЛОПЕРИОДА(Месяцы.Месяц, МЕСЯЦ) И КОНЕЦПЕРИОДА(Месяцы.Месяц, МЕСЯЦ)
		               |				ИЛИ Месяцы.Месяц МЕЖДУ СвязанныеРемонты.ДатаНачалаРемонта И СвязанныеРемонты.ДатаОкончанияРемонта)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ВидПодчиненностиРемонта,
		               |	НомерКолонкиПоПорядку,
		               |	ДатаНачалаРемонта
		               |ИТОГИ
		               |	МАКСИМУМ(ТехнологическийН),
		               |	МАКСИМУМ(ЗаводскойН),
		               |	МАКСИМУМ(ИнвентарныйН)
		               |ПО
		               |	ВидПодчиненностиРемонта,
		               |	НаименовОбъекта";
		# КонецОбласти

		Запрос.УстановитьПараметр("Ссылка"               , ОстановочныйРемонт);
		Запрос.УстановитьПараметр("ТаблицаДатПоМесяцам"  , ТаблицаДатПоМесяцам);
		Запрос.УстановитьПараметр("ОсновнойОбъектРемонта", ОстановочныйРемонт.ОбъектРемонта);
		Запрос.УстановитьПараметр("ВидРемонта"           , ОстановочныйРемонт.ВидРемонта);
				
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаВидПодчиненностиРемонта = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		НомерВидаПодчиненности = 1;
		
		Пока ВыборкаВидПодчиненностиРемонта.Следующий() Цикл
			
			ОбластьВерхнийУровень = Макет.ПолучитьОбласть("СтрокаЗаполненияВерхнийУровень");
			
			Если ВыборкаВидПодчиненностиРемонта.ВидПодчиненностиРемонта = 1 Тогда
				ОбластьВерхнийУровень.Параметры.НаименовОбъекта = НСтр("es='Las reparaciones del objeto básico de la reparación';ru='Ремонты основного объекта ремонта';en='Repairs of the main object of repair'");
			ИначеЕсли ВыборкаВидПодчиненностиРемонта.ВидПодчиненностиРемонта = 2 Тогда
				ОбластьВерхнийУровень.Параметры.НаименовОбъекта = НСтр("es='Las reparaciones de la maquinaria dependiente';ru='Ремонты зависимого оборудования';en='Repair of dependent equipment'");
			Иначе
				ОбластьВерхнийУровень.Параметры.НаименовОбъекта = НСтр("es='Las reparaciones de la maquinaria subordinada';ru='Ремонты подчиненного оборудования';en='Repair of slave equipment'");				
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьВерхнийУровень);
			НомерКолонкиПоПорядку = 1;
			 
			Пока Не НомерКолонкиПоПорядку = ОбщееЧислоКолонок Цикл
				НомерКолонкиПоПорядку = НомерКолонкиПоПорядку + 1;
				Область = Макет.ПолучитьОбласть("Значение");
				ТабДок.Присоединить(Область);
			КонецЦикла; 
			
			ВыборкаОбъектыРемонта = ВыборкаВидПодчиненностиРемонта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			НомерПоПорядку = 1;
			
			Пока ВыборкаОбъектыРемонта.Следующий() Цикл
				
				СтрокаСДанными = Макет.ПолучитьОбласть("СтрокаЗаполнения");			
				
				ЗаполнитьЗначенияСвойств(СтрокаСДанными.Параметры, ВыборкаОбъектыРемонта,, "НаименовОбъекта");
				
				СтрокаСДанными.Параметры.НаименовОбъекта = ПолучитьПредставление(ВыборкаОбъектыРемонта.НаименовОбъекта, СоответствиеОбъектовРемонтаПредставлениям, "ПолучитьПредоставленияОРДляПечати");
				СтрокаСДанными.Параметры.НПП             = Формат(НомерПоПорядку, "ЧДЦ=; ЧН=; ЧГ=") + ".";
				
				ТабДок.Вывести(СтрокаСДанными);
				
                ТекстПоВидамРемонта        = "";
                НомерКолонкиПоПорядку      = 1;
                НомерПоПорядку             = НомерПоПорядку + 1;
                ПерваяСтрока               = Истина;
				
				Выборка = ВыборкаОбъектыРемонта.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					Если НЕ Выборка.НомерКолонкиПоПорядку  = НомерКолонкиПоПорядку Тогда
						
						Пока НомерКолонкиПоПорядку < Выборка.НомерКолонкиПоПорядку Цикл
							Область = Макет.ПолучитьОбласть("Значение");
							Область.Параметры.Заполнение = ТекстПоВидамРемонта;
							ТабДок.Присоединить(Область);
                            ТекстПоВидамРемонта = "";
                            НомерКолонкиПоПорядку      = НомерКолонкиПоПорядку + 1;
                            ПерваяСтрока        = Истина;
						КонецЦикла; 
						
					КонецЕсли; 
				
						
					ТекстПоВидамРемонта = ТекстПоВидамРемонта 
											+ ?(ПерваяСтрока, "", Символы.ПС)
											+ ПолучитьПредставление(Выборка.ВидРемонта
													, СоответствиеВидовРемонтаПредставлениям
													, "ПолучитьПредоставленияВРДляПечати") 
											+ "( " + Формат(Выборка.ДатаНачалаРемонта, "ДФ=dd.MM") + " - " 
											+ Формат(Выборка.ДатаОкончанияРемонта, "ДФ=dd.MM") + ")";
					
					ПерваяСтрока = Ложь;
					
				КонецЦикла;
										
				Если НЕ ТекстПоВидамРемонта = "" Тогда
					
					Область = Макет.ПолучитьОбласть("Значение");
					Область.Параметры.Заполнение = ТекстПоВидамРемонта;
					ТабДок.Присоединить(Область);
					ТекстПоВидамРемонта = "";
					НомерКолонкиПоПорядку = НомерКолонкиПоПорядку + 1;

				КонецЕсли; 	
				
				Пока Не НомерКолонкиПоПорядку = ОбщееЧислоКолонок Цикл
					НомерКолонкиПоПорядку = НомерКолонкиПоПорядку + 1;
					Область = Макет.ПолучитьОбласть("Значение");
					ТабДок.Присоединить(Область);
				КонецЦикла; 
				 
				
			КонецЦикла; 
		КонецЦикла;
		
	КонецЦикла; 
	
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьПредставление(Ссылка, Соответствие, ИмяФункции)
	
	Представление = Соответствие.Получить(Ссылка);
	
	Если НЕ Представление = Неопределено Тогда
		Возврат Представление;
	Иначе
		Представление = "";
		Выполнить("Представление =торо_ЗаполнениеДокументов." + ИмяФункции + "(Ссылка)");
		Соответствие.Вставить(Ссылка, Представление);
		Возврат Представление;
	КонецЕсли; 
	
КонецФункции

// Процедура - Проставить признак зависимый подчиненный
//
// Параметры:
//  ТаблицаЗаполнения		 - ТаблицаЗначения, ТабличнаяЧасть - Таблица, в которой протавляются флаги
//  ОсновнойОбъектРемонта	 - СправочникСсылка.торо_ОбъектыРемонта - Основной объект ремонта
//  ОсновнойВидРемонта		 - СправочникСсылка.торо_ВидыРемонтов - Основной вид ремонта
//  ИмяПоляОбъектаРемонта	 - Строка - Имя поля, в котором находятся объекты ремонта 
//  ИмяПоляВидРемонта		 - Строка - Имя поля, в котором находятся виды ремонтов
//
Процедура ПроставитьПризнакЗависимыйПодчиненный(ТаблицаЗаполнения, ОсновнойОбъектРемонта, ОсновнойВидРемонта, ИмяПоляОбъектаРемонта = "ОбъектРемонта", ИмяПоляВидРемонта = "ВидРемонта")Экспорт
	
	Если ТипЗнч(ТаблицаЗаполнения) = Тип("ДанныеФормыКоллекция") Тогда
		ВспомогательнаяТаблица = ТаблицаЗаполнения.Выгрузить();
	Иначе
		ВспомогательнаяТаблица = ТаблицаЗаполнения;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	# Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта КАК СвязанныйОбъектРемонта,
	               |	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаЗависимогоОбъекта КАК ВидРемонтаЗависимогоОбъекта
	               |ИЗ
	               |	РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
	               |ГДЕ
	               |	торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта = &ОсновнойОбъектРемонта
	               |	И торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта В(&МассивОбъектовДляЗаполнения)
	               |	И (торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаОсновногоОбъекта = &ВидРемонта
	               |			ИЛИ торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаОсновногоОбъекта = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка))";
	# КонецОбласти
	
    Запрос.УстановитьПараметр("ОсновнойОбъектРемонта"      , ОсновнойОбъектРемонта);
    Запрос.УстановитьПараметр("ВидРемонта"                 , ОсновнойВидРемонта);
	Запрос.УстановитьПараметр("МассивОбъектовДляЗаполнения", ВспомогательнаяТаблица.ВыгрузитьКолонку(ИмяПоляОбъектаРемонта));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить(ИмяПоляОбъектаРемонта, Выборка.СвязанныйОбъектРемонта);
		
		Если ЗначениеЗаполнено(Выборка.ВидРемонтаЗависимогоОбъекта) Тогда
			СтруктураПоиска.Вставить(ИмяПоляВидРемонта    , Выборка.ВидРемонтаЗависимогоОбъекта);
		КонецЕсли; 
		
		МассивИмеющихсяСтрок = ТаблицаЗаполнения.НайтиСтроки(СтруктураПоиска);
		
		Для каждого Строка Из МассивИмеющихсяСтрок Цикл
			Строка.Зависимый = Истина;
		КонецЦикла; 
		
	КонецЦикла; 
	
	Для каждого Строка Из ТаблицаЗаполнения Цикл
		
		Если Строка.Зависимый
			ИЛИ Строка[ИмяПоляОбъектаРемонта] = ОсновнойОбъектРемонта Тогда
			Продолжить;
		КонецЕсли; 
		
		Строка.Подчиненный = Истина;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
